/**
########### 装备物品 ##############
协议号:15030
c >> s:
    int:32 装备物品Id
    int:16 装备格子位置,  0 默认位置，1 武器，2 衣服，3 腰带，4 护腕， 5 护手， 6 头饰，7 鞋子，8 饰品一，9 饰品二，10 戒指一，11 戒指二，12 灵宠 ,13 时装,14婚戒 15 武器时装 16饰品时装
s >> c:
    int:16 
        0 => 失败 
        1 => 成功
        2 => 物品不存在
        3 => 物品不属于你所有
        4 => 物品不在背包
        5 => 物品类型不可装备
        6 => 装备位置错误
        7 => 等级不符合
        8 => 职业不符合
        9 => 性别不符合
        10 => 物品已过期
    int:32 物品Id
    int:32 原物品Id
    int:32 原物品类型Id
    int:16 原物品当前格子位置
    int:32 装备加成气血，失败为0，没有加成也为0
    int:32 装备加成法力
    int:32 装备加成最大攻击
    int:32 装备加成最小攻击
    int:32 装备加成最大魔法攻击
    int:32 装备加成最小魔法攻击
    int:32 装备加成最大道术攻击
    int:32 装备加成最小道术攻击
    int:32 装备加成最大防御
    int:32 装备加成最小防御
    int:32 装备加成最大魔法防御
    int:32 装备加成最小魔法防御
    int:16 装备加成命中
    int:16 装备加成闪避
    int:16 装备加成魔法闪避
    int:16 装备加成暴击
    int:16 装备加成毒素抗性
    int:16 装备加成中毒恢复
    int:16 装备加成生命恢复
    int:16 装备加成法力恢复
    int:16 装备加成忽视防御
    int:16 装备加成伤害反弹
    int:16 装备加成伤害吸收
    int:16 装备加成暴击额外伤害
    int:16 装备加成生命偷取
    int:16 装备加成法力削减
    int:16 装备加成装备防爆率
    int:16 装备加成击杀他人装备爆出率
*/
package hgGame.socket.command.c15
{
	import hgCommon.baseData.Int16;
	public class CCMD15030
	{
		public function CCMD15030()
		{
		}
		public var a_id:int;
		public var b_sitGrid:Int16;

	}
}